In [31]:
import numpy as np
import pandas as pd

## Foi criado duas lista, posteriormente chamei a função pd.series para criar uma serie com o index seno a lista x

In [4]:
x = ['a','b','c','d','e','f']
conteudo = [0,12,25,44,33,88]

In [5]:
A = pd.Series(data=conteudo, index=x)
A

a     0
b    12
c    25
d    44
e    33
f    88
dtype: int64

In [6]:
type(A)

pandas.core.series.Series

## foi criado duas series, foi mudado um index e com isso foi somado as duas series

In [7]:
corais = pd.Series([2,8,5,6,5], index = ['zoanthus', 'dunkan', 'trompet', 'gsp', 'alveopora'])
corais

zoanthus     2
dunkan       8
trompet      5
gsp          6
alveopora    5
dtype: int64

In [8]:
corais2 = pd.Series([2,8,5,6,5], index = ['zoanthus', 'dunkan', 'trompet', 'goniopora', 'alveopora'])
corais2

zoanthus     2
dunkan       8
trompet      5
goniopora    6
alveopora    5
dtype: int64

In [9]:
corais + corais2

alveopora    10.0
dunkan       16.0
goniopora     NaN
gsp           NaN
trompet      10.0
zoanthus      4.0
dtype: float64

## criando data frames, usando numeros aleatorios com a função random do numpy

In [10]:
np.random.seed(51)

In [11]:
df = pd.DataFrame(np.random.randn(5,5), index= ['a','b','c','d','e'], columns= '1 2 3 4 5'.split() )
df

          1         2         3         4         5
a -0.290503  0.112128  1.250795 -1.360890  0.099933
b -0.047991 -0.356230 -1.088559 -0.351018  2.588400
c -0.505651 -0.584309 -1.273099  0.746783 -0.558346
d -0.110802 -1.187337 -1.008226 -0.689862 -0.085643
e  0.822753  0.916024  1.716848  0.519260  1.828716

In [13]:
df['3']

a    1.250795
b   -1.088559
c   -1.273099
d   -1.008226
e    1.716848
Name: 3, dtype: float64

In [14]:
type(df)

pandas.core.frame.DataFrame

In [19]:
df[df['4']> 0.05]

          1         2         3         4         5
c -0.505651 -0.584309 -1.273099  0.746783 -0.558346
e  0.822753  0.916024  1.716848  0.519260  1.828716

## Indicies multiniveis

In [46]:
outside=['A1','A1','A1','A2','A2','A2','A2', ]
inside=[1,2,3,1,2,3]
hier_index=list(zip(outside,inside))
hier_index=pd.MultiIndex.from_tuples(hier_index)

In [47]:
df = pd.DataFrame(np.random.randn(6,2), index = hier_index, columns=['X', 'Y'])

In [48]:
df

             X         Y
A1 1  0.086851  0.377674
   2  2.492942  0.252962
   3 -0.188286 -1.109575
A2 1  0.103898  1.332366
   2  1.106978 -0.396001
   3 -1.240282  0.655923

In [54]:
df.index.names = ['Catagoria 1', 'Sub-categoria2']
df

                                   X         Y
Catagoria 1 Sub-categoria2
A1          1               0.086851  0.377674
            2               2.492942  0.252962
            3              -0.188286 -1.109575
A2          1               0.103898  1.332366
            2               1.106978 -0.396001
            3              -1.240282  0.655923

In [57]:
df.xs('A1') ## metodo ultilizado para encontrar sub index

                       X         Y
Sub-categoria2
1               0.086851  0.377674
2               2.492942  0.252962
3              -0.188286 -1.109575

In [62]:
df.xs(2, level ='Sub-categoria2')

                    X         Y
Catagoria 1
A1           2.492942  0.252962
A2           1.106978 -0.396001

## Dados Ausentes
## foi criado um data frame com dados ausentes e

In [66]:
f = {'x':[4,np.nan,5], 'c':[4,5,87], 'd':[np.nan,np.nan,65]}

In [67]:
g = pd.DataFrame(f)

In [68]:
g

     x   c     d
0  4.0   4   NaN
1  NaN   5   NaN
2  5.0  87  65.0

In [76]:
g.dropna(thresh = 2) # o metodo dropna com a condição thresh exlui a linha com os valores nan igual a 2 valores nan

     x   c     d
0  4.0   4   NaN
2  5.0  87  65.0

In [77]:
g.fillna(5) ## esse metodo substitui as nan por 5

     x   c     d
0  4.0   4   5.0
1  5.0   5   5.0
2  5.0  87  65.0

In [78]:
g['x'].fillna(value = g['x'].mean())

0    4.0
1    4.5
2    5.0
Name: x, dtype: float64

## GroupBy

In [100]:
Data = {'Empresa':['goog', 'goog', 'MSFT','MSFT', 'FB', 'FB'],
       'Nome':["leo", "winicius","solange", "angelo", "gabriel", "matheus"],
        'vendas':[100,200,400,456,234,788]}

In [101]:
f= pd.DataFrame(Data)
f

  Empresa      Nome  vendas
0    goog       leo     100
1    goog  winicius     200
2    MSFT   solange     400
3    MSFT    angelo     456
4      FB   gabriel     234
5      FB   matheus     788

In [102]:
grupo = f.groupby('Empresa') ## o mrtodo groupby vai agrupar todas as empresas da coluna empresa
grupo

In [107]:
grupo["vendas"].sum()

Empresa
FB      1022
MSFT     856
goog     300
Name: vendas, dtype: int64

In [106]:
mean_vendas = grupo['vendas'].mean()
mean_vendas

Empresa
FB      511.0
MSFT    428.0
goog    150.0
Name: vendas, dtype: float64

## Contatenar, juntar e mesclar

In [109]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])

In [111]:
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7])

In [112]:
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])

In [113]:
pd.concat([df1,df2,df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [116]:
pd.concat([df1,df2,df3], axis = 1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

In [123]:
esquerda = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
   
direita = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})

In [124]:
direita

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

In [125]:
esquerda

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [126]:
pd.merge(esquerda,direita, how = 'inner', on = 'key' )

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [127]:
esquerda = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                        'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3']})
    
direita = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                               'key2': ['K0', 'K0', 'K0', 'K0'],
                                  'C': ['C0', 'C1', 'C2', 'C3'],
                                  'D': ['D0', 'D1', 'D2', 'D3']})

In [128]:
pd.merge(esquerda, direita, on=['key1', 'key2'])

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [131]:
pd.merge(esquerda, direita, how = 'outer' ,on=['key1', 'key2'])

  key1 key2    A    B    C    D
0   K0   K0   A0   B0   C0   D0
1   K0   K1   A1   B1  NaN  NaN
2   K1   K0   A2   B2   C1   D1
3   K1   K0   A2   B2   C2   D2
4   K2   K0  NaN  NaN   C3   D3
5   K2   K1   A3   B3  NaN  NaN

In [132]:
pd.merge(esquerda, direita, how = 'left' ,on=['key1', 'key2'])

  key1 key2   A   B    C    D
0   K0   K0  A0  B0   C0   D0
1   K0   K1  A1  B1  NaN  NaN
2   K1   K0  A2  B2   C1   D1
3   K1   K0  A2  B2   C2   D2
4   K2   K1  A3  B3  NaN  NaN

In [133]:
pd.merge(esquerda, direita, how = 'right' ,on=['key1', 'key2'])

  key1 key2    A    B   C   D
0   K0   K0   A0   B0  C0  D0
1   K1   K0   A2   B2  C1  D1
2   K1   K0   A2   B2  C2  D2
3   K2   K0  NaN  NaN  C3  D3

In [134]:
esquerda = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2']) 

direita = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])

In [135]:
esquerda.join(direita)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [136]:
esquerda.join(direita, how='outer')

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

## operações

In [137]:
df = pd.DataFrame({'A':[1,2,3,4],'B':[444,555,666,444],'C':['abc','def','ghi','xyz']})
df

   A    B    C
0  1  444  abc
1  2  555  def
2  3  666  ghi
3  4  444  xyz

In [138]:
df['B'].unique()

array([444, 555, 666], dtype=int64)

In [140]:
df['B'].nunique()

3

In [142]:
df['B'].value_counts()

B
444    2
555    1
666    1
Name: count, dtype: int64

In [144]:
df[(df['A']>1) & (df['B']>=555)]

   A    B    C
1  2  555  def
2  3  666  ghi

In [148]:
def vezes2(x):
    return x*2

In [153]:
df['B'].apply(vezes2) # o apply aplica uma função para todo elemento do dataframe citado

0     888
1    1110
2    1332
3     888
Name: B, dtype: int64

In [154]:
del df['A']

In [155]:
df

     B    C
0  444  abc
1  555  def
2  666  ghi
3  444  xyz

In [156]:
df. sort_values(by = 'B')

     B    C
0  444  abc
3  444  xyz
1  555  def
2  666  ghi

In [157]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)

In [158]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [160]:
df.pivot_table(values= 'D', index=['A','B'], columns=['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN